RechardNabo/PIC_Microcontroller_PIC18F8720/PIC18F8720_3_Timers.X/main.c
// PIC18F8720 Configuration Bit Settings
// 'C' source line config statements
// CONFIG1H
#pragma config OSC = HS         // Oscillator Selection bits (HS oscillator)
#pragma config OSCS = OFF       // Oscillator System Clock Switch Enable bit (Oscillator system clock switch option is disabled (main oscillator is source))

// CONFIG2L
#pragma config PWRT = OFF       // Power-up Timer Enable bit (PWRT disabled)
#pragma config BOR = OFF         // Brown-out Reset Enable bit (Brown-out Reset enabled)
#pragma config BORV = 25        // Brown-out Reset Voltage bits (VBOR set to 2.5V)

// CONFIG2H
#pragma config WDT = OFF        // Watchdog Timer Enable bit (WDT disabled (control is placed on the SWDTEN bit))
#pragma config WDTPS = 128      // Watchdog Timer Postscale Select bits (1:128)

// CONFIG3L
#pragma config MODE = MC        // Processor Mode Select bits (Microcontroller mode)
#pragma config WAIT = OFF       // External Bus Data Wait Enable bit (Wait selections unavailable for table reads and table writes)

// CONFIG3H
#pragma config CCP2MUX = OFF    // CCP2 Mux bit (CCP2 is multiplexed with RB3 in Extended Microcontroller, Microprocessor or Microprocessor with Boot Block mode. Or with RE7 in Microcontroller mode.)

// CONFIG4L
#pragma config STVR = OFF       // Stack Full/Underflow Reset Enable bit (Stack full/underflow will not cause Reset)
#pragma config LVP = OFF        // Low-Voltage ICSP Enable bit (Low-voltage ICSP disabled)

// CONFIG5L
#pragma config CP0 = OFF        // Code Protection bit (Block 0 (000200-003FFFh) not code-protected)
#pragma config CP1 = OFF        // Code Protection bit (Block 1 (004000-007FFFh) not code-protected)
#pragma config CP2 = OFF        // Code Protection bit (Block 2 (008000-00BFFFh) not code-protected)
#pragma config CP3 = OFF        // Code Protection bit (Block 3 (00C000-00FFFFh) not code-protected)
#pragma config CP4 = OFF        // Code Protection bit (Block 4 (010000-013FFFh) not code-protected)
#pragma config CP5 = OFF        // Code Protection bit (Block 5 (014000-017FFFh) not code-protected)
#pragma config CP6 = OFF        // Code Protection bit (Block 6 (018000-01BFFFh) not code-protected)
#pragma config CP7 = OFF        // Code Protection bit (Block 7 (01C000-01FFFFh) not code-protected)

// CONFIG5H
#pragma config CPB = OFF        // Boot Block Code Protection bit (Boot Block (000000-0001FFh) not code-protected)
#pragma config CPD = OFF        // Data EEPROM Code Protection bit (Data EEPROM not code-protected)

// CONFIG6L
#pragma config WRT0 = OFF       // Write Protection bit (Block 0 (000200-003FFFh) not write-protected)
#pragma config WRT1 = OFF       // Write Protection bit (Block 1 (004000-007FFFh) not write-protected)
#pragma config WRT2 = OFF       // Write Protection bit (Block 2 (008000-00BFFFh) not write-protected)
#pragma config WRT3 = OFF       // Write Protection bit (Block 3 (00C000-00FFFFh) not write-protected)
#pragma config WRT4 = OFF       // Write Protection bit (Block 4 (010000-013FFFh) not write-protected)
#pragma config WRT5 = OFF       // Write Protection bit (Block 5 (014000-017FFFh) not write-protected)
#pragma config WRT6 = OFF       // Write Protection bit (Block 6 (018000-01BFFFh) not write-protected)
#pragma config WRT7 = OFF       // Write Protection bit (Block 7 (01C000-01FFFFh) not write-protected)

// CONFIG6H
#pragma config WRTC = OFF       // Configuration Register Write Protection bit (Configuration registers (300000-3000FFh) not write-protected)
#pragma config WRTB = OFF       // Boot Block Write Protection bit (Boot Block (000000-0001FFh) not write-protected)
#pragma config WRTD = OFF       // Data EEPROM Write Protection bit (Data EEPROM not write-protected)

// CONFIG7L
#pragma config EBTR0 = OFF      // Table Read Protection bit (Block 0 (000200-003FFFh) not protected from table reads executed in other blocks)
#pragma config EBTR1 = OFF      // Table Read Protection bit (Block 1 (004000-007FFFh) not protected from table reads executed in other blocks)
#pragma config EBTR2 = OFF      // Table Read Protection bit (Block 2 (008000-00BFFFh) not protected from table reads executed in other blocks)
#pragma config EBTR3 = OFF      // Table Read Protection bit (Block 3 (00C000-00FFFFh) not protected from table reads executed in other blocks)
#pragma config EBTR4 = OFF      // Table Read Protection bit (Block 4 (010000-013FFFh) not protected from table reads executed in other blocks)
#pragma config EBTR5 = OFF      // Table Read Protection bit (Block 5 (014000-017FFFh) not protected from table reads executed in other blocks)
#pragma config EBTR6 = OFF      // Table Read Protection bit (Block 6 (018000-01BFFFh) not protected from table reads executed in other blocks)
#pragma config EBTR7 = OFF      // Table Read Protection bit (Block 7 (01C000-01FFFFh) not protected from table reads executed in other blocks)

// CONFIG7H
#pragma config EBTRB = OFF      // Boot Block Table Read Protection bit (Boot Block (000000-0001FFh) not protected from table reads executed in other blocks)
#include <xc.h>
#include <stdio.h>

#include "LCD.h"
#define _XTAL_FREQ 0x12BFCE0
#define TRUE 0x01
#define FALSE 0x00
#define TIMER_DELAY 100
volatile int count = 0x00;
void TIMER0_Init();
void __interrupt ISR();
void main(void) {
    char s[20];
    float counter = 0;
    TRISDbits.TRISD0 = 0x00;
    TRISDbits.TRISD7 = 0x00;
    
    TIMER0_Init();
   
    LCD_SETUP_4BIT();
    LCD_INITIALIZE_4BIT();
    
    
    while(TRUE){
      
        PORTDbits.RD0 ^= 0x01;
        __delay_ms(TIMER_DELAY);
        LCD_20_LINE1();
        
        LCD_DISPLAY("PIC18 TIMERS");
        LCD_20_LINE2();
        sprintf(s,"cnt %.1f",counter);
        counter -=-10;
        LCD_DISPLAY("TIMER-0 : ");
        LCD_DISPLAY(s);
        LCD_20_LINE3();
        if(LATDbits.LD0 == 0x01){
            LCD_DISPLAY("RD0 is ON ");
        }
        else{
            LCD_DISPLAY("RD0 is OFF ");
        }
        LCD_20_LINE4();
   
        if(PORTDbits.RD7 == 0x01){
            LCD_DISPLAY("RD7 is ON ");
        }
        else{
            LCD_DISPLAY("RD7 is OFF");
        }
      
    }
    return;
}
void TIMER0_Init(){
    T0CONbits.T0PS = 0b111;
    T0CONbits.PSA = 0x00;
    T0CONbits.T0SE = 0x00;
    T0CONbits.T0CS = 0x00;
    T0CONbits.T08BIT = 0x01;
    TMR0 = 0x00;
    INTCONbits.TMR0IE = 0x01;
    //INTCONbits.T0IF = 0x00;
    //INTCONbits.T0IE = 0x01;
    INTCONbits.GIE = 0x01;
    INTCONbits.PEIE = 0x01;
}
void __interrupt ISR(){
    if(INTCONbits.TMR0IF == 0x01){
        TMR0 = 100;
        INTCONbits.TMR0IF = 0x00;
        count -=-0x01;
    }
    if(count == TIMER_DELAY){
        PORTDbits.RD7 ^=0x01; 
        count = 0x00;
    }
    
}
